cukier/Mems/src/Mems/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.2.0 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# BLE (NimBLE) for the INVOKE Band protocol — see main/invoke_ble.c and
# docs/INVOKE_BLE_ESPECIFICACAO.md. Peripheral (GATT/NUS to the app),
# broadcaster + observer (mesh flooding over advertising) all active at once.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_MAX_BONDS=0
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
CONFIG_FREERTOS_HZ=1000

# No host-based privacy / RPA. on_sync() sets its own static random address
# once per boot and there is no bonding (MAX_BONDS=0), so the privacy machinery
# only half-initialises — it fails to persist the local IRK and that state
# intermittently breaks connection establishment (reason 0x3e). Spec §4 does
# not ask for privacy.
CONFIG_BT_NIMBLE_HS_PVCY=n

# Flood mesh: every relay of a message matters, so the controller must not
# dedupe scan results (spec §4 "scan passivo, sem filtro de duplicatas"). The
# host already passes filter_duplicates=0, but the C3 controller keeps its own
# dedupe cache unless this is off.
CONFIG_BT_CTRL_BLE_SCAN_DUPL=n
